20240511T041838--kdoc-170-pdfしおりを使いやすくする__wiki.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-01 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 170: PDFしおりを使いやすくする</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 170: PDFしおりを使いやすくする</h1>

<div id="outline-container-orgb92cae5" class="outline-2">
<h2 id="orgb92cae5"><a href="#orgb92cae5">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgb92cae5">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-13 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-05-19 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4b2372d" class="outline-2">
<h2 id="org4b2372d"><a href="#org4b2372d">ブックマーク</a></h2>
<div class="outline-text-2" id="text-org4b2372d">
<p>
Chrome組み込みのPDFビューワや<a href="https://github.com/mozilla/pdf.js">pdf.js</a>では、URLフラグメントで開くページを指定できる。リロードしても、前に指定していたページを開ける。現在ページをURLフラグメントに指定することで、しおり代わりにしている。
</p>

<p>
URLにページを直入力していたのだが、ボタンでできるようにした。Chrome組み込みのPDFビューワはHTMl要素をいじれなかったので、pdf.jsにボタンを追加した。ブックマークレットでやるのもいいだろう。
</p>

<p>
<a href="https://mozilla.github.io/pdf.js/web/viewer.html">pdf.js Online Demo</a>でコンソールに入れて試せる。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>URLフラグメントを現在ページで書き換える</label><pre class="src src-javascript"><span class="org-keyword">const</span> <span class="org-variable-name">page</span> = PDFViewerApplication.pdfViewer.currentPageNumber;
window.location.hash = <span class="org-string">`page=${page}`</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd292e4c" class="outline-2">
<h2 id="orgd292e4c"><a href="#orgd292e4c">関連</a></h2>
<div class="outline-text-2" id="text-orgd292e4c">
<ul class="org-ul">
<li><a href="20240324T120408--kdoc-127-chromeのpdfビューワでしおりを使う__essay.html#ID-20240324T120408">KDOC 127: ChromeのPDFビューワでしおりを使う</a>をボタンでできるようにした</li>
</ul>
</div>
</div>


<div id="outline-container-orgf777880" class="outline-2">
<h2 id="orgf777880"><a href="#orgf777880">Backlinks</a></h2>
<div class="outline-text-2" id="text-orgf777880">
<ul class="org-ul">
<li><a href="./20240511T103303--kdoc-171-pdf本棚を作る__project.html">KDOC 171: PDF本棚を作る</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
